[
  "Do you agree or disagree with the following statement? “Social media has improved communication among people.” Explain your opinion.",
  "Do you agree or disagree that television has had a mostly positive effect on modern society? Support your opinion with details and examples.",
  "Do you agree or disagree that learning math and science is more important than learning subjects like literature or the arts? Use specific reasons and examples to support your answer.",
  "Do you agree or disagree that all students should be required to learn a second language in school? Explain your opinion using specific examples.",
  "Do you agree or disagree that online learning is more effective than traditional in-person education? Use examples to support your opinion.",
  "Do you agree or disagree that family members have a stronger influence on young adults than their friends do? Explain your answer with details.",
  "Do you think it is better to follow your passion or to have a stable job? Explain your opinion.",
  "Do you agree or disagree with the statement that “All high school students should learn a foreign language”? Provide reasons for your opinion.",
  "Do you think that students should have a longer summer vacation? Explain your view.",
  "Do you think it’s better to make quick decisions or take your time to decide carefully? Use reasons and examples to explain your opinion.",
  "Do you agree or disagree that 18-year-olds are not mature enough to vote? Explain your opinion with specific details.",
  "Do you agree or disagree that people enjoy concerts or movies more when they go with friends? Support your answer with reasons.",
  "Do you agree or disagree that children should learn how to draw or paint at school? Use examples to explain your view.",
  "Do you agree or disagree with the following statement? It is easier to be a teacher than to be a student. Use details and examples to explain your answer.",
  "Should universities spend money on student entertainment such as concerts and movie nights? Explain your opinion.",
  "Do you agree or disagree that artists and musicians play an important role in society? Support your answer with examples.",
  "Do you agree or disagree that people live healthier lives today than they did 100 years ago? Explain your opinion with details.",
  "Do you agree or disagree that in the future, fewer people will read books? Support your response with reasons.",
  "Do you think it’s better for college students to attend school full-time or part-time? Explain your choice.",
  "Should schools stop teaching handwriting and focus only on typing skills? Give reasons to support your opinion.",
  "Do you agree or disagree that students should sit in assigned seats during class? Explain your reasons with examples.",
  "Do you agree or disagree that learning a second language is more important now than ever before? Use details to explain your opinion.",
  "Do you think technology makes people more productive or more distracted? Explain your viewpoint.",
  "Do you agree or disagree with the idea that “college education should be free for everyone”? Provide reasons for your opinion.",
  "Do you think it is more important to have a lot of money or to have a happy family life? Explain your answer.",
  "Do you agree or disagree that children should receive money for doing chores at home? Support your opinion with specific reasons.",
  "Do you agree or disagree that private cars should be banned from the downtown areas of large cities? Explain your viewpoint.",
  "Do you agree or disagree that a university’s academic reputation should be the top factor when choosing where to study? Use examples to support your answer.",
  "Do you agree or disagree that kind and friendly teachers help students learn more effectively? Use details to support your opinion.",
  "Do you agree or disagree that reading fiction is more enjoyable for students than reading nonfiction? Support your opinion with specific examples.",
  "Some people believe print materials will become obsolete, while others think books and newspapers will always be valued. Which opinion do you agree with and why?",
  "Do you agree or disagree that friends have the biggest influence on a person’s life? Explain your opinion with examples.",
  "Do you agree or disagree that schools should teach practical life skills, such as managing money or cooking? Explain your opinion.",
  "Do you agree or disagree that students learn better in large classes than in small ones? Support your answer with specific reasons.",
  "Do you agree or disagree that parents should have a say in the university their child attends? Explain your opinion with examples.",
  "Do you agree or disagree that parents should help their children choose a career path? Use details and examples to support your opinion.",
  "Do you agree or disagree that TV ads for unhealthy snacks should not be shown to young children? Explain your opinion with reasons.",
  "Do you agree or disagree that children should be allowed to watch any TV programs they want? Explain your viewpoint.",
  "Do you agree or disagree that music education and learning to play an instrument are important parts of a child’s education? Use examples to support your opinion.",
  "Do you agree or disagree that making mistakes is one of the most effective ways to learn something? Support your answer with examples.",
  "Do you agree or disagree that learning from past experiences is important for the future? Use examples to support your view.",
  "Do you agree or disagree that mobile phones should not be allowed in classrooms? Use examples and reasons to support your opinion.",
  "Do you agree or disagree that learning about different cultures is important for students? Use details and examples in your explanation.",
  "Do you agree or disagree with the statement that “Children should be given more responsibilities at home”? Provide reasons for your opinion.",
  "Do you think that technology has made people more isolated from each other? Explain your view.",
  "Do you agree or disagree with the statement that “Traveling is the best way to learn about different cultures”? Provide reasons for your opinion.",
  "Do you think that people should spend more time on hobbies rather than working long hours? Explain your answer.",
  "Do you agree or disagree with the statement that “The best way to solve problems is through teamwork”? Explain your opinion.",
  "Do you think that schools should focus more on practical skills rather than academic subjects? Provide reasons for your view.",
  "Do you agree or disagree with the statement that “It is better to learn from mistakes than to avoid making them”? Explain your opinion.",
  "Do you think that people should always follow the rules, even if they believe the rules are unfair? Explain your view.",
  "Do you agree or disagree with the statement that “High salaries are the most important factor in job satisfaction”? Provide reasons for your opinion.",
  "Do you think that volunteering should be mandatory for high school students? Explain your opinion.",
  "Do you agree or disagree with the statement that “It is better to be a leader than a follower”? Provide reasons for your view.",
  "Do you think that modern technology is making people less creative? Explain your opinion.",
  "Do you agree or disagree with the statement that “People should spend more time outdoors”? Provide reasons for your opinion.",
  "Do you think that traditional methods of teaching are still effective in today’s world? Explain your view.",
  "Do you agree or disagree with the statement that “Students should be allowed to use smartphones in class”? Provide reasons for your opinion.",
  "Do you think that it’s more important to be honest or to be kind? Explain your view.",
  "Do you agree or disagree with the idea that “Success is determined more by hard work than by talent”? Provide reasons for your opinion."
]

